VoltCyclone/imxrtnsy/src/kmbox.c
// Multi-protocol command injection over LPUART6
// Auto-detects and handles three protocols on the same UART:
//   - KMBox B binary: sync 0x57 0xAB, cmd, len, payload, checksum
//   - Makcu binary:   sync 0x50, cmd, len_lo, len_hi, payload
//   - Ferrum text:    km.command(args)\n  (any printable ASCII start)
//
// Integrates smooth injection queue with FPU-based humanization tremor.
// Merges injected keyboard/mouse inputs additively with real device HID reports.

#include "kmbox.h"
#include "smooth.h"
#include "ferrum.h"
#include "makcu.h"
#include "imxrt.h"
#include "usb_device.h"
#include <string.h>

extern uint32_t millis(void);

// ---- UART constants ----
#ifndef UART_BAUD
#define UART_BAUD  2000000
#endif
#define UART_CLOCK 24000000

// ---- eDMA RX ring buffer (non-cacheable via MPU region 10) ----
#define DMA_RX_RING_SIZE 256
static uint8_t dma_rx_ring[DMA_RX_RING_SIZE]
	__attribute__((section(".dmabuffers"), aligned(DMA_RX_RING_SIZE)));
static volatile uint16_t rx_tail;

// ---- eDMA TX: staging ring -> DMA channel 2 -> LPUART6_DATA ----
// Software ring for staging; DMA copies contiguous chunks to UART hardware.
#define TX_RING_SIZE 128
static uint8_t tx_ring[TX_RING_SIZE];
static uint8_t tx_head;
static uint8_t tx_tail_pos;

// DMA TX linear buffer — non-cacheable for DMA coherency
#define DMA_TX_BUF_SIZE 64
static uint8_t dma_tx_buf[DMA_TX_BUF_SIZE]
	__attribute__((section(".dmabuffers"), aligned(4)));

// ---- Multi-protocol dispatcher state ----
typedef enum {
	PROTO_IDLE,       // waiting for first byte to determine protocol
	PROTO_KMBOX,      // in KMBox B binary frame
	PROTO_MAKCU,      // in Makcu binary frame
	PROTO_FERRUM      // accumulating text line
} proto_mode_t;

// ---- KMBox B parser states ----
typedef enum {
	KB_SYNC2,
	KB_CMD,
	KB_LEN,
	KB_PAYLOAD,
	KB_CHECKSUM
} kb_state_t;

// ---- Makcu parser states ----
typedef enum {
	MK_CMD,
	MK_LEN_LO,
	MK_LEN_HI,
	MK_PAYLOAD
} mk_state_t;

// ---- Injection state ----
typedef struct {
	int16_t  mouse_dx;
	int16_t  mouse_dy;
	uint8_t  mouse_buttons;
	int8_t   mouse_wheel;
	bool     mouse_dirty;

	uint8_t  kb_modifier;
	uint8_t  kb_keys[6];
	bool     kb_dirty;

	// Click auto-release: mask of buttons to release after click_release_at
	uint8_t  click_release_mask;
	uint32_t click_release_at; // millis() timestamp, 0 = inactive
} kmbox_inject_t;

// ---- Static state ----

// Protocol dispatcher
static proto_mode_t proto_mode;

// KMBox B parser
static kb_state_t   kb_parse_state;
static uint8_t      frame_buf[KMBOX_MAX_PAYLOAD];
static uint8_t      frame_cmd;
static uint8_t      frame_len;
static uint8_t      frame_pos;
static uint8_t      frame_checksum;

// Makcu parser
static mk_state_t   mk_parse_state;
static uint8_t      mk_cmd;
static uint16_t     mk_len;
static uint16_t     mk_pos;
static uint8_t      mk_buf[MAKCU_MAX_PAYLOAD];

// Ferrum line buffer
static char         ferrum_line[FERRUM_MAX_LINE];
static uint8_t      ferrum_pos;

// Shared injection state
static kmbox_inject_t inject;
static uint32_t frames_ok;
static uint32_t frames_err;
static uint32_t rx_bytes_total;

// Cached EP info — set once at enumeration, avoids per-poll iface scanning
static uint8_t  cached_mouse_ep;    // EP number for mouse (0 = not found)
static uint16_t cached_mouse_maxpkt;
static uint8_t  cached_kb_ep;       // EP number for keyboard (0 = not found)
// Mouse report field layout — parsed from HID report descriptor
static struct {
	uint16_t x_bit;         // bit offset of X in data (after report ID byte)
	uint16_t y_bit;         // bit offset of Y
	uint16_t wheel_bit;     // bit offset of wheel (0xFFFF = none)
	uint8_t  x_size;        // X field size in bits (8 or 16 typically)
	uint8_t  y_size;        // Y field size in bits
	uint8_t  wheel_size;    // wheel field size in bits
	uint8_t  report_id;     // 0 = no report ID byte
	uint8_t  data_off;      // byte offset of data start (0 or 1)
	bool     valid;         // true if X and Y were found
	int16_t  x_max;         // precomputed (1 << (x_size-1)) - 1
	int16_t  y_max;         // precomputed (1 << (y_size-1)) - 1
	int16_t  w_max;         // precomputed (1 << (wheel_size-1)) - 1
} mouse_layout;
static uint8_t cached_mouse_report_len; // actual report length from first real report

// Track whether a merge happened this cycle (reset each poll)
static bool merged_this_cycle;

// ---- Forward declarations ----
static void dispatch_kmbox_frame(void);
static void dispatch_makcu_frame(void);
static void dispatch_ferrum_line(void);
static void apply_mouse_result(int16_t dx, int16_t dy, uint8_t buttons,
                               int8_t wheel, bool use_smooth);

// ---- Non-blocking TX: enqueue to ring, DMA flushes to UART ----
static void tx_enqueue(uint8_t b)
{
	uint8_t next = (tx_head + 1) & (TX_RING_SIZE - 1);
	if (next == tx_tail_pos) return; // full — drop byte
	tx_ring[tx_head] = b;
	tx_head = next;
}

static void tx_enqueue_buf(const uint8_t *data, uint8_t len)
{
	for (uint8_t i = 0; i < len; i++)
		tx_enqueue(data[i]);
}

static void tx_enqueue_str(const char *s)
{
	while (*s) tx_enqueue((uint8_t)*s++);
}

// Kick DMA channel 2 to send a contiguous chunk from the ring buffer.
// Called from kmbox_poll. Copies pending ring bytes into the linear DMA
// staging buffer, then fires a single DMA transfer. Hardware drains one
// byte per TDRE — zero CPU until next poll.
static void tx_flush(void)
{
	// If previous transfer still in flight, let it finish
	if (!(DMA_TCD2_CSR & DMA_TCD_CSR_DONE) &&
	    DMA_TCD2_CITER_ELINKNO != DMA_TCD2_BITER_ELINKNO)
		return;
	DMA_CDNE = 2; // clear DONE flag for next transfer

	// Copy pending ring bytes into linear DMA buffer
	uint8_t count = 0;
	while (tx_tail_pos != tx_head && count < DMA_TX_BUF_SIZE) {
		dma_tx_buf[count++] = tx_ring[tx_tail_pos];
		tx_tail_pos = (tx_tail_pos + 1) & (TX_RING_SIZE - 1);
	}
	if (count == 0) return;

	// Update only the 3 TCD fields that change per flush (static fields set in kmbox_init)
	DMA_TCD2_SADDR = (volatile const void *)dma_tx_buf;
	DMA_TCD2_CITER_ELINKNO = count;
	DMA_TCD2_BITER_ELINKNO = count;
	DMA_TCD2_CSR = DMA_TCD_CSR_DREQ; // auto-disable requests on completion
	DMA_SERQ = 2; // enable channel 2 requests — DMA fires on each TDRE
}
void kmbox_init(void)
{
	// Enable LPUART6 clock gate
	CCM_CCGR3 |= CCM_CCGR3_LPUART6(CCM_CCGR_ON);

	// Pin 1 (GPIO_AD_B0_02) = LPUART6_TX (ALT2)
	IOMUXC_SW_MUX_CTL_PAD_GPIO_AD_B0_02 = 2;
	IOMUXC_SW_PAD_CTL_PAD_GPIO_AD_B0_02 =
		IOMUXC_PAD_DSE(6) | IOMUXC_PAD_SPEED(2);
	IOMUXC_LPUART6_TX_SELECT_INPUT = 1;

